In [1]:
import pandas as pd

In [74]:
# pandas was creating for working with financial data

In [2]:
data = pd.read_csv('stock_data.csv',index_col='Date')
data.head()

                 High        Low       Open      Close       Volume  Adj Close
Date
2020-01-02  86.139999  84.342003  84.900002  86.052002   47660500.0  86.052002
2020-01-03  90.800003  87.384003  88.099998  88.601997   88892500.0  88.601997
2020-01-06  90.311996  88.000000  88.094002  90.307999   50665000.0  90.307999
2020-01-07  94.325996  90.671997  92.279999  93.811996   89410500.0  93.811996
2020-01-08  99.697998  93.646004  94.739998  98.428001  155721500.0  98.428001

In [3]:
type(data)

pandas.core.frame.DataFrame

In [4]:
type(data['Close'])

pandas.core.series.Series

In [5]:
data[['Close','Volume']].head()

                Close       Volume
Date
2020-01-02  86.052002   47660500.0
2020-01-03  88.601997   88892500.0
2020-01-06  90.307999   50665000.0
2020-01-07  93.811996   89410500.0
2020-01-08  98.428001  155721500.0

In [6]:
data.iloc[1] # getting the data from the second row

High         9.080000e+01
Low          8.738400e+01
Open         8.810000e+01
Close        8.860200e+01
Volume       8.889250e+07
Adj Close    8.860200e+01
Name: 2020-01-03, dtype: float64

In [7]:
data.loc[['2020-01-06','2020-01-02']]

                 High        Low       Open      Close      Volume  Adj Close
Date
2020-01-06  90.311996  88.000000  88.094002  90.307999  50665000.0  90.307999
2020-01-02  86.139999  84.342003  84.900002  86.052002  47660500.0  86.052002

In [8]:
data.loc['2020-01-06']

High         9.031200e+01
Low          8.800000e+01
Open         8.809400e+01
Close        9.030800e+01
Volume       5.066500e+07
Adj Close    9.030800e+01
Name: 2020-01-06, dtype: float64

In [9]:
data.iloc[1:5] # getting row from second to fifth row

                 High        Low       Open      Close       Volume  Adj Close
Date
2020-01-03  90.800003  87.384003  88.099998  88.601997   88892500.0  88.601997
2020-01-06  90.311996  88.000000  88.094002  90.307999   50665000.0  90.307999
2020-01-07  94.325996  90.671997  92.279999  93.811996   89410500.0  93.811996
2020-01-08  99.697998  93.646004  94.739998  98.428001  155721500.0  98.428001

In [10]:
data.loc['2020-01-01':'2020-01-30'] # range of value from the index date

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2020-01-02,86.139999,84.342003,84.900002,86.052002,47660500.0,86.052002
2020-01-03,90.800003,87.384003,88.099998,88.601997,88892500.0,88.601997
2020-01-06,90.311996,88.000000,88.094002,90.307999,50665000.0,90.307999
2020-01-07,94.325996,90.671997,92.279999,93.811996,89410500.0,93.811996
2020-01-08,99.697998,93.646004,94.739998,98.428001,155721500.0,98.428001
2020-01-09,99.760002,94.573997,99.419998,96.267998,142202000.0,96.267998
2020-01-10,96.987999,94.739998,96.358002,95.629997,64797500.0,95.629997
2020-01-13,105.125999,98.400002,98.699997,104.972000,132588000.0,104.972000
2020-01-14,109.482002,104.980003,108.851997,107.584000,144981000.0,107.584000
2020-01-15,107.568001,103.358002,105.952003,103.699997,86844000.0,103.699997
2020-01-16,102.891998,98.433998,98.750000,102.697998,108683500.0,102.697998
2020-01-17,103.134003,100.632004,101.522003,102.099998,68145500.0,102.099998
2020-01-21,109.716003,105.681999,106.050003,109.440002,89017500.0,109.440002
2020-01-22,118.900002,111.820000,114.377998,113.912003,156845000.0,113.912003
2020-01-23,116.400002,111.120003,112.849998,114.440002,98255000.0,114.440002
2020-01-24,114.772003,110.851997,114.125999,112.963997,71768000.0,112.963997
2020-01-27,112.888000,107.856003,108.398003,111.603996,68040500.0,111.603996
2020-01-28,115.362000,111.615997,113.697998,113.379997,58942500.0,113.379997
2020-01-29,117.959999,113.486000,115.138000,116.197998,89007500.0,116.197998
2020-01-30,130.175995,123.599998,126.484001,128.162003,145028500.0,128.162003

In [11]:
data.to_excel('stock_data.xlsx')

In [12]:
# df=pd.read_excel('stock_data.xlsx')

In [13]:
# df.head()

In [14]:
data['Close_plus_10']=data['Close']+10

In [15]:
data.head()

,High,Low,Open,Close,Volume,Adj Close,Close_plus_10
Date,,,,,,,
2020-01-02,86.139999,84.342003,84.900002,86.052002,47660500.0,86.052002,96.052002
2020-01-03,90.800003,87.384003,88.099998,88.601997,88892500.0,88.601997,98.601997
2020-01-06,90.311996,88.000000,88.094002,90.307999,50665000.0,90.307999,100.307999
2020-01-07,94.325996,90.671997,92.279999,93.811996,89410500.0,93.811996,103.811996
2020-01-08,99.697998,93.646004,94.739998,98.428001,155721500.0,98.428001,108.428001

### Series

In [16]:
my_list=[1,2,3,4,5]
s1 = pd.Series(my_list)

In [17]:
s1.head() # having index and a value but we can give it out own index as well

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
my_dict = {'a':'apple','b':'ball','c':'cat','d':'dog'}

In [19]:
my_dict

{'a': 'apple', 'b': 'ball', 'c': 'cat', 'd': 'dog'}

In [20]:
pd.Series(my_dict,index=my_dict.keys()) # making our own index using the key of the dictionary

a    apple
b     ball
c      cat
d      dog
dtype: object

In [21]:
list_2 = [1,2,'3',4]

In [22]:
s2 = pd.Series(list_2)

In [23]:
s2.head()

0    1
1    2
2    3
3    4
dtype: object

In [24]:
s2[0]

1

In [25]:
type(s2[0])

int

In [26]:
type(s2[2])

str

In [27]:
type(s1[0])

numpy.int64

In [28]:
s1*2 # multuplying on each entry

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [29]:
s1.values # array has the restriction from the list that all the entries should be of the same data type

array([1, 2, 3, 4, 5])

In [34]:
dict_1 = {'nepal':1,'india':2,'china':3}
s4 = pd.Series(dict_1)

dict_2 = {'nepal':2,'japan':3,'indonesia':4}
s5 = pd.Series(dict_2)
s5+s4

china        NaN
india        NaN
indonesia    NaN
japan        NaN
nepal        3.0
dtype: float64

### DataFrames

In [56]:
# a dataframe can be constructed out of a dictionary

data = {'country':['nepal']*2+['usa']*2,
       'year':[2000,1999,1998,2000],
       'population':[10,7,80,60]}

In [41]:
country_info = pd.DataFrame(data)
country_info.head()

  country  year  population
0   nepal  2000          10
1   nepal  1999           7
2     usa  1998          80
3     usa  2000          60

In [43]:
type(country_info['year']) # each column is a series

pandas.core.series.Series

In [44]:
type(country_info.loc[1])

pandas.core.series.Series

In [46]:
country_info.loc[2:3] # loc index is inclusive while for iloc it is not

  country  year  population
2     usa  1998          80
3     usa  2000          60

In [48]:
country_info.iloc[2:3] # last index is exclusive

  country  year  population
2     usa  1998          80

In [54]:
country_info.iloc[1:3]['year']

1    1999
2    1998
Name: year, dtype: int64

In [55]:
country_info.loc[1:3,'year']

1    1999
2    1998
3    2000
Name: year, dtype: int64

In [57]:
df_with_index = pd.DataFrame(data,index=[1,2,1,2])
df_with_index.head()

  country  year  population
1   nepal  2000          10
2   nepal  1999           7
1     usa  1998          80
2     usa  2000          60

In [59]:
df_with_index.loc[1] # returns all the rows with index of 1

  country  year  population
1   nepal  2000          10
1     usa  1998          80

In [61]:
df_with_index.iloc[1] # returns second row by the actual index location

country       nepal
year           1999
population        7
Name: 2, dtype: object

In [62]:
df_with_str_index = pd.DataFrame(data,index=['a','b','c','d'])

In [63]:
df_with_str_index.loc['b':'d']

  country  year  population
b   nepal  1999           7
c     usa  1998          80
d     usa  2000          60

In [65]:
df_with_str_index.loc['b':'d','country':'year'] # everything is inclusive in loc

  country  year
b   nepal  1999
c     usa  1998
d     usa  2000

In [67]:
df_with_str_index.loc['b':'d',['country','population']]

  country  population
b   nepal           7
c     usa          80
d     usa          60

In [68]:
df_with_str_index.loc[['b','d'],['country','population']]

  country  population
b   nepal           7
d     usa          60

In [69]:
# adding new columns to the dataframe

In [70]:
df_with_index.head()

  country  year  population
1   nepal  2000          10
2   nepal  1999           7
1     usa  1998          80
2     usa  2000          60

In [71]:
df_with_index['area']=[200,200,1000,1000]
df_with_index.head()

  country  year  population  area
1   nepal  2000          10   200
2   nepal  1999           7   200
1     usa  1998          80  1000
2     usa  2000          60  1000

In [72]:
df_with_index['pop_density']=df_with_index['population']/df_with_index['area']

In [73]:
df_with_index.head()

  country  year  population  area  pop_density
1   nepal  2000          10   200        0.050
2   nepal  1999           7   200        0.035
1     usa  1998          80  1000        0.080
2     usa  2000          60  1000        0.060

In [77]:
# selecting country column having the value of usa

df_with_index[df_with_index['country']=='usa']

  country  year  population  area  pop_density
1     usa  1998          80  1000         0.08
2     usa  2000          60  1000         0.06

In [78]:
# selecting all population density above 0.05

df_with_index[df_with_index['pop_density']>0.05]

  country  year  population  area  pop_density
1     usa  1998          80  1000         0.08
2     usa  2000          60  1000         0.06

In [81]:
# setting country column as the index

df_index_country=df_with_index.set_index('country') 
df_index_country

         year  population  area  pop_density
country
nepal    2000          10   200        0.050
nepal    1999           7   200        0.035
usa      1998          80  1000        0.080
usa      2000          60  1000        0.060

In [82]:
df_index_country.loc['nepal']

         year  population  area  pop_density
country
nepal    2000          10   200        0.050
nepal    1999           7   200        0.035

In [83]:
# setting multi-index

df_index_co_pop = df_with_index.set_index(['country','population'])
df_index_co_pop

                    year  area  pop_density
country population
nepal   10          2000   200        0.050
        7           1999   200        0.035
usa     80          1998  1000        0.080
        60          2000  1000        0.060

In [93]:
df_index_co_pop['year']

country  population
nepal    10            2000
         7             1999
usa      80            1998
         60            2000
Name: year, dtype: int64

In [97]:
df_index_co_pop.loc['nepal']

            year  area  pop_density
population
10          2000   200        0.050
7           1999   200        0.035

In [98]:
# accessing the two indices at the same time

df_index_co_pop.loc['nepal'].loc[10]

year           2000.00
area            200.00
pop_density       0.05
Name: 10, dtype: float64

In [99]:
# using cross_section to access index at level 1 having the key 10

df_index_co_pop.xs(10,level=1)

         year  area  pop_density
country
nepal    2000   200         0.05